//Напишите цикл, который принимает на вход два числа (A и B)
//и возводит число A в натуральную степень B.
//3, 5 -> 243 (3⁵)
//2, 4 -> 16

Console.Write("Введите число A: ");
int NumA = int.Parse(Console.ReadLine());
Console.Write("Введите число B: ");
int NumB = int.Parse(Console.ReadLine());

ToDegree(NumA, NumB);

void ToDegree(int a, int b)
{
    int result = 1;
    for (int i = 1; i <= b; i++)
    {
        result = result * a;
    }
    Console.WriteLine(result);
}